feat(client): Port .NET backend to client-side TypeScript
